app/views/favorites/_favorite.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
		<%= link_to book_favorites_path(book), method: :delete, remote: true do %>
			<i class="fas fa-heart", style="color: red;"></i><%= book.favorites.count %>いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 4]]
---
		<%= link_to book_favorites_path(book), method: :post, remote: true do %>
			<i class="fas fa-heart"></i><%= book.favorites.count %>いいね