app/views/chats/_chat.html.erb

        <%= chat.content %><br>
        <small><%= chat.user.name %> | <%= chat.created_at.strftime("%Y/%m/%d") %></small>
---
INSERT INTO "chats" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["room_id", 3], ["content", "sdfdsfsd"], ["created_at", "2020-10-04 04:40:13.657849"], ["updated_at", "2020-10-04 04:40:13.657849"]]