app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 7]]
---
				</td>
				<td class="comment-count"><%= pluralize(@book.book_comments.count, "comment") %></td>