app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @comment_new = current_user.book_comments.new(book_comment_params)
    @comment_new.book_id = @book.id
    @comment_new.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "book_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ｆｆｆ"], ["book_id", 6], ["user_id", 2], ["created_at", "2020-10-02 01:11:33.516626"], ["updated_at", "2020-10-02 01:11:33.516626"]]

  def destroy
    # session[:previous_url] = request.referer
    @book = Book.find(params[:book_id])
    @comment_new = BookComment.new
    @book_comment = BookComment.find_by(book_id: params[:book_id], id: params[:id])
    if @book_comment.user = current_user
      @book_comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."id" = ? LIMIT ?  [["book_id", 7], ["id", 14], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 14]]