app/controllers/chats_controller.rb

  def create
    if UserRoom.where(user_id: current_user.id, room_id: params[:chat][:room_id]).present?
      @chat = Chat.create(chat_params.merge(user_id: current_user.id))
      @chats = Room.find(@chat.room_id).chats.all
---
SELECT  1 AS one FROM "chats" WHERE "chats"."room_id" = ? LIMIT ?  [["room_id", 3], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = ?  [["room_id", 3]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 1], ["room_id", 3]]
INSERT INTO "chats" ("user_id", "room_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["room_id", 3], ["content", "sdfs"], ["created_at", "2020-10-04 04:28:20.182264"], ["updated_at", "2020-10-04 04:28:20.182264"]]
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]