app/controllers/rooms_controller.rb

  def create
    @room = Room.create
    @entry1 = Entry.create(room_id: @room.id, user_id: current_user.id)
    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(room_id: @room.id))
---
INSERT INTO "rooms" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-10-04 01:48:21.453484"], ["updated_at", "2020-10-04 01:48:21.453484"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 13], ["created_at", "2020-10-04 02:40:34.861276"], ["updated_at", "2020-10-04 02:40:34.861276"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["room_id", 1], ["created_at", "2020-10-04 04:19:12.506311"], ["updated_at", "2020-10-04 04:19:12.506311"]]
INSERT INTO "entries" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["room_id", 12], ["created_at", "2020-10-04 02:38:33.712662"], ["updated_at", "2020-10-04 02:38:33.712662"]]
INSERT INTO "user_rooms" ("user_id", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["room_id", 3], ["created_at", "2020-10-04 04:24:30.861784"], ["updated_at", "2020-10-04 04:24:30.861784"]]

  def show
    @room = Room.find(params[:id])

    if Entry.where(user_id: current_user.id, room_id: @room.id).present?
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = ? AND "entries"."room_id" = ?  [["user_id", 2], ["room_id", 13]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ? AND "user_rooms"."room_id" = ?  [["user_id", 1], ["room_id", 3]]