app/controllers/users_controller.rb

SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 11]]
SELECT "user_rooms".* FROM "user_rooms" WHERE "user_rooms"."user_id" = ?  [["user_id", 2]]
---
  def show
    @user = User.find(params[:id])
    @books = @user.books
    @book = Book.new

    @currentuser_user_room = UserRoom.where(user_id: current_user.id)
    @user_user_room = UserRoom.where(user_id: @user.id)
    if !(@user.id == current_user.id)
      @currentuser_user_room.each do |cu|
        @user_user_room.each do |u|