app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def prefecture_name=(prefecture_name)
    self.prefecture_code = JpPrefecture::Prefecture.find(name: prefectire_name).code

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 25]]
---
  def unfollow(other_user)
    self.active_relationships.find_by(followed_id: other_user.id).destroy